app/views/tweets/index.html.erb

    <h1>Tweets</h1>
    <%if Current.user.twitter_accounts.any? %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT 1 AS one FROM "twitter_accounts" WHERE "twitter_accounts"."user_id" = ? LIMIT ?  [["user_id", 9], ["LIMIT", 1]]


<% if Current.user.twitter_accounts.none? %>
---
SELECT 1 AS one FROM "twitter_accounts" WHERE "twitter_accounts"."user_id" = ? LIMIT ?  [["user_id", 9], ["LIMIT", 1]]