app/controllers/omniauth_callbacks_controller.rb

  def twitter
    Rails.logger.info auth
    # ensure it will be there one account with taht name
    twitter_account  = Current.user.twitter_accounts.where(username: auth.info.nickname).first_or_initialize
---
SELECT "twitter_accounts".* FROM "twitter_accounts" WHERE "twitter_accounts"."user_id" = ? AND "twitter_accounts"."username" = ? ORDER BY "twitter_accounts"."id" ASC LIMIT ?  [["user_id", 7], ["username", "Elarabyelaidy"], ["LIMIT", 1]]