app/controllers/password_resets_controller.rb

    def update
        @user = User.find_signed!(params[:token], purpose: "reset password" )
        if @user.update(password_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$J.SCwYZU9qtFwygPl27ITe86LMIzRHwDmsCNXaXfBjafvs3C.6XPu"], ["updated_at", "2022-04-01 01:44:08.379630"], ["id", 3]]