app/controllers/tweets_controller.rb

    def create
        @tweet = Current.user.tweets.new(tweet_params)
        if @tweet.save
---
INSERT INTO "tweets" ("user_id", "twitter_account_id", "body", "publish_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 11], ["twitter_account_id", 6], ["body", "test"], ["publish_at", "2022-05-12 13:15:00"], ["created_at", "2022-05-11 13:15:11.071283"], ["updated_at", "2022-05-11 13:15:11.071283"]]

    def update
        if @tweet.update(tweet_params)
---
UPDATE "tweets" SET "body" = ?, "publish_at" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["body", "38"], ["publish_at", "2022-05-12 17:25:00"], ["updated_at", "2022-05-12 15:23:47.304062"], ["id", 9]]

    def set_tweet
        @tweet = Current.user.tweets.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ? AND "tweets"."id" = ? LIMIT ?  [["user_id", 11], ["id", 3], ["LIMIT", 1]]