app/controllers/twitter_accounts_controller.rb

    def destroy
        @twitter_account.destroy
---
DELETE FROM "twitter_accounts" WHERE "twitter_accounts"."id" = ?  [["id", 3]]

    def set_twitter_account
        @twitter_account = Current.user.twitter_accounts.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "twitter_accounts".* FROM "twitter_accounts" WHERE "twitter_accounts"."user_id" = ? AND "twitter_accounts"."id" = ? LIMIT ?  [["user_id", 9], ["id", 3], ["LIMIT", 1]]